kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-OLED-V_4_7_3/ESP32-S3-Host-OLED-V_4_7_3.ino
/**
 * ============================================================================
 * โครงการวิจัย: ผลของการใช้นวัตกรรม Smart IV Alert ต่อความแม่นยำในการแจ้งเตือนและปริมาณสารน้ำที่ได้รับ
 * หน่วยงาน: หอผู้ป่วยอายุรกรรม โรงพยาบาลสูงเม่น จังหวัดแพร่
 * สถาบัน: วิทยาลัยพยาบาลบรมราชชนนี แพร่ คณะพยาบาลศาสตร์ สถาบันพระบรมราชชนก
 *
 * ระบบ: Central Host Gateway (เครื่องควบคุมและติดตามศูนย์กลาง)
 * เวอร์ชัน: 4.7.2-OLED (Protocol v3 — ใช้คู่กับ Bed Station 7.4.x / 7.5.x / 7.7.x)
 * บอร์ดประมวลผล: ESP32-S3 Dev Module (N16R8) + จอ 1.3" OLED (SH1106 I2C) + Passive Buzzer
 *
 * ผู้พัฒนาระบบ: นายกิตติพันธ์ รัตนคร (นักวิชาการคอมพิวเตอร์ มจร. วิทยาเขตแพร่)
 * อาจารย์ที่ปรึกษา: ดร.กรรณิการ์ กาศสมบูรณ์ (วิทยาลัยพยาบาลบรมราชชนนี แพร่)
 *
 * ---------------------------------------------------------------------------
 * เปลี่ยนใน V4.7.2-OLED: ปรับหน้าเว็บ Dashboard ตามที่พยาบาลขอมา
 *  1) สถานะปกติมี "กรอบสีเขียว" รอบการ์ดเตียง มองแวบเดียวรู้ว่าเตียงไหนเรียบร้อย
 *     (เดิมปกติไม่มีกรอบ ทำให้แยกจากเตียงออฟไลน์ด้วยสายตายาก)
 *  2) การเตือนใกล้หมดบอกเป็น "% ของสารน้ำ" แทนตัวเลข mL ที่ตั้งไว้
 *     และเพิ่มบรรทัด "เหลือในกระปุก ... mL" ในการ์ดทุกใบ (เดิมมีแต่ยอดที่ให้ไปแล้ว)
 *  3) เพิ่มแถบแจ้งเตือนรวมบนหน้า Live Monitor บอกว่าเตียงไหนเป็นอะไร
 *     ครอบคลุมทั้ง ไหลช้า / ไหลเร็ว / ไม่ไหล / ให้ครบแล้ว / เซนเซอร์ไม่จับหยด
 *     พร้อมแถบสีส้มแยกต่างหากสำหรับเตียงที่ใกล้หมด (เฝ้าดู ไม่ใช่เหตุวิกฤต)
 *  4) เสียงเตือนบนหน้าเว็บกระตุ้นความสนใจขึ้น — จากเสียงไซน์ 880 Hz ครั้งเดียว
 *     เป็นชุด 4 พัลส์สลับสองความถี่แบบรถพยาบาล ใช้คลื่นสี่เหลี่ยมที่มีฮาร์มอนิกมาก
 *     จึงแทรกผ่านเสียงรบกวนในหอผู้ป่วยได้ดีกว่า และปล่อยซ้ำทุก 2 วินาทีจนกว่าเหตุจะหาย
 *  5) ป้ายเวอร์ชันบนหัวหน้าเว็บอ่านจาก APP_VERSION จริง (เดิมค้างที่ v4.6.0)
 *
 *  ตรรกะการวัด การแจ้งเตือน และโปรโตคอล ESP-NOW ไม่เปลี่ยนแม้แต่ไบต์เดียว
 *
 * ---------------------------------------------------------------------------
 * เปลี่ยนใน V4.7.1-OLED: รองรับเครื่องประจำเตียงรุ่นใหม่ (v7.5.1 และ v7.7.0)
 *
 *  โครงสร้างแพ็กเก็ต ESP-NOW ของ Station v7.5.1 และ v7.7.0 เหมือน v7.4.x ทุกไบต์
 *  (struct_message 23 ไบต์ / struct_host_sync 20 ไบต์) และสูตรตัดสินสายพับก็สูตรเดียวกัน
 *  จึงใช้งานร่วมกันได้อยู่แล้วโดยไม่ต้องแก้โปรโตคอล — ตรวจซ้ำได้ด้วย tools/protocol-test
 *
 *  แต่มีช่องโหว่ที่เห็นชัดขึ้นเมื่อใช้กับ v7.7.0 ซึ่งมีสถานะ "เซนเซอร์ยังจับหยดไม่ได้"
 *  ในตัวเครื่องเอง ขณะที่ Host เดิมไม่มีสถานะนี้เลย:
 *
 *   เตียงที่ออนไลน์อยู่ กำลังนับอยู่ แต่เซนเซอร์ไม่เคยจับหยดได้สักหยดเดียว
 *   (วางเซนเซอร์ผิดตำแหน่ง สายหลุด เลนส์สกปรก) Host เดิมจะขึ้นว่า "ปกติ" ตลอดไป
 *   เพราะเงื่อนไขสายพับกำหนดว่าต้องเคยมีหยดมาก่อน (totalDrops == 0 -> ไม่เข้าเงื่อนไข)
 *   นี่คือความล้มเหลวแบบเงียบ ซึ่งอันตรายกว่าการแจ้งเตือนผิด เพราะพยาบาลเข้าใจว่า
 *   ระบบกำลังเฝ้าอยู่ ทั้งที่ไม่ได้นับอะไรเลย
 *
 *  สิ่งที่เพิ่ม
 *   - รหัสเตือนใหม่ ALERT_NO_SIGNAL (6) = "เซนเซอร์ยังไม่จับหยด" แยกจากสายพับชัดเจน
 *     เพราะสองอย่างนี้ให้พยาบาลไปดูคนละจุด (สายพับ = ดูสายน้ำเกลือ, ไม่มีสัญญาณ = ดูเซนเซอร์)
 *   - เงื่อนไข: ออนไลน์ + กำลังนับ + ยังไม่เคยมีหยดเลย + ต่อเนื่องเกิน NO_SIGNAL_MS
 *   - ถือเป็นเหตุวิกฤต จึงมีเสียงเตือนที่ Host และขึ้นบนจอ OLED / หน้าเว็บ / ไฟล์ CSV
 *   - **ไม่ส่งรหัสนี้ออกไปที่ Station** เพื่อความเข้ากันได้ย้อนหลังอย่างสมบูรณ์
 *     (Station รุ่นเก่าไม่รู้จักรหัส 6) ตอนส่ง Sync จะแปลงเป็น ALERT_NONE เสมอ
 *     เครื่องที่เตียงรุ่น v7.7.0 มีสถานะ CHECK SENSOR ของตัวเองอยู่แล้ว
 *
 * ---------------------------------------------------------------------------
 * เปลี่ยนใน V4.7.0: ตัดระบบจัดการ Wi-Fi (Router/อินเทอร์เน็ต) ออกทั้งหมด
 *  - Host ทำงานเป็น Access Point อย่างเดียว (WIFI_AP) ไม่ต่อ Router ไม่ใช้ NTP
 *    -> ไม่มีการสแกนช่อง/รีคอนเนกต์มาแย่งเวลาคลื่นวิทยุ ESP-NOW และ Web Server อีก
 *  - รองรับสมาร์ตโฟน/แท็บเล็ตพร้อมกันได้ถึง AP_MAX_CLIENTS เครื่อง (เดิมค่าปริยาย 4
 *    และในโหมด AP+STA เหลือใช้งานจริงเพียง 2-3 เครื่อง)
 *  - ปิดโหมดประหยัดพลังงานของ Wi-Fi (WIFI_PS_NONE) ให้ตอบสนองหลายเครื่องพร้อมกันได้นิ่ง
 *  - ESP-NOW ส่งผ่านอินเทอร์เฟซ AP (WIFI_IF_AP) เพราะไม่มี STA แล้ว
 *  - ตั้งเวลาจากนาฬิกาของเครื่องที่เปิดหน้าเว็บโดยอัตโนมัติ (แทน NTP) และสำรองเวลาไว้ใน NVS
 *    ทุก 10 นาที เพื่อให้เวลาไม่หายเมื่อไฟดับ (แสดงเป็น "เวลาโดยประมาณ" จนกว่าจะซิงก์ใหม่)
 *  - หน้าเว็บ: เอาเมนูจัดการ Wi-Fi ออก เหลือหน้าต่างแสดงข้อมูลจุดเชื่อมต่อแบบอ่านอย่างเดียว
 *    และหยุด Poll ข้อมูลเมื่อสลับแท็บไปทำอย่างอื่น (ลดภาระเมื่อมีผู้ใช้หลายเครื่อง)
 *
 * ---------------------------------------------------------------------------
 * เพิ่มใน V4.6.0: แจ้งเตือนใกล้หมด (เตรียมถุงใหม่)
 *  - ตั้ง % ต่อเตียงจากหน้าเว็บ (50-95%, ค่าเริ่มต้น 80%) เก็บถาวรใน NVS
 *  - Host เสียงเตือนเบา 3 ครั้ง ซ้ำทุก 5 นาทีจนกว่าจะรับทราบ (ที่เตียง / ปุ่ม POWER / หน้าเว็บ)
 *  - รับทราบแล้วซิงก์ไปทุกจุด และล้างเมื่อกด "เริ่มถุงใหม่" หรือแก้ปริมาตร/เปอร์เซ็นต์
 *
 * สรุปการแก้ไขจาก V4.4.1 (โค้ดภายในระบุ 6.3.2)
 *  1) แก้จุดที่คอมไพล์ไม่ผ่าน (ฟิลด์ใน StationData / ชื่อฟังก์ชัน-ตัวแปรใน loop)
 *  2) โครงสร้างแพ็กเก็ต ESP-NOW ตรงกับ Station ทุกไบต์ (มี static_assert ตรวจขนาด)
 *  3) Station ส่งอัตราไหลที่คำนวณจากช่วงห่างระหว่างหยด + เวลาตั้งแต่หยดล่าสุด
 *     -> เลิกคำนวณ rate จากหน้าต่าง 2 วินาทีที่ทำให้แจ้งเตือนสายพับผิด
 *  4) Host เป็นผู้ตัดสินรหัสเตือนจุดเดียว เรียก evaluateClinicalAlerts() ทุก 1 วินาที
 *  5) ส่ง Sync ทุก 1 วินาที (เดิม 10 วินาที ขณะที่ Station ตัดสินว่าหลุดที่ 5 วินาที)
 *  6) เพิ่ม API /api/stations/config และ /api/stations/reset
 *     ค่า Target Rate / Plan Volume / Drop Factor / ชื่อผู้ป่วย เก็บที่ Host (NVS)
 *  7) Drop factor ใช้ค่าของแต่ละเตียง (10/15/20/60) แทนค่าคงที่ 20
 *  8) นับหยดรายนาทีจากผลต่าง totalDrops -> แพ็กเก็ตหายไม่ทำให้ข้อมูลหาย
 *  9) SoftAP ล็อก Channel 1
 * 10) Deep sleep ใช้ ext0 wakeup (esp_deep_sleep_enable_gpio_wakeup ไม่รองรับ ESP32-S3)
 * 11) ปุ่ม POWER กดสั้นขณะมีเสียงเตือน = พักเสียง 2 นาที (Snooze)
 * ============================================================================
 */

#include <WiFi.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <WebServer.h>
#include <Preferences.h>
#include <ESPmDNS.h>
#include <U8g2lib.h>
#include <Wire.h>
#include <time.h>
#include <sys/time.h>
#include <driver/rtc_io.h>

#define APP_VERSION         "4.7.3-OLED"
#define DEV_NAME            "กิตติพันธ์ รัตนคร"
#define DEV_ROLE            "นักวิชาการคอมพิวเตอร์"
#define DEV_INSTITUTION     "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาเขตแพร่"

// ----------------------------------------------------------------------------
// กำหนดขาเชื่อมต่อฮาร์ดแวร์ฝั่ง Host
// ----------------------------------------------------------------------------
#define HOST_BAT_ADC_PIN    1   // ขาอ่านแบตเตอรี่ Host
#define POWER_BTN_PIN       4   // ปุ่มเปิด-ปิดหน้าจอ / พักเสียงเตือน (Snooze) — ต้องเป็น RTC GPIO (0-21)
#define PAGE_BTN_PIN        5   // ปุ่มเปลี่ยนหน้าจอ / ดับเบิ้ลคลิกเรียก Screensaver
#define BUZZER_PIN          7   // ขาต่อลำโพง Passive Buzzer
#define OLED_SDA_PIN        8   // ขา I2C SDA จอ OLED
#define OLED_SCL_PIN        9   // ขา I2C SCL จอ OLED

// ----------------------------------------------------------------------------
// ค่าคงที่ของระบบสื่อสารและการแจ้งเตือน (ต้องตรงกับ Station)
// ----------------------------------------------------------------------------
#define ESPNOW_CHANNEL          1        // ช่อง SoftAP / ESP-NOW เริ่มต้น
#define SYNC_INTERVAL_MS        1000     // แต่ละเตียงได้รับ Sync ครบ 1 ใบทุก 1 วินาที
#define SYNC_SLOT_MIN_MS        60       // ช่องเวลาต่ำสุดระหว่างแพ็กเก็ต Sync สองใบ
#define ONLINE_TIMEOUT_MS       8000     // ไม่ได้รับข้อมูลเกิน 8 วินาที = OFFLINE
                                         // Station ส่งวินาทีละใบ ค่านี้จึงยอมให้หายติดกัน 8 ใบ
                                         // (เดิม 5 วินาที = 5 ใบ ซึ่งน้อยเกินไปเมื่อมีหลายเตียง)
#define LINK_WINDOW_MS          10000UL  // หน้าต่างวัดคุณภาพลิงก์ (คาดหวัง 10 ใบ)
#define LINK_WEAK_PCT           60       // ต่ำกว่านี้ = ลิงก์อ่อน เตือนก่อนหลุดจริง
#define OLED_ANIM_INTERVAL_MS   90       // ~11 เฟรม/วินาที ขณะมีหยดให้แสดง
#define OLED_IDLE_INTERVAL_MS   400      // ไม่มีหยดให้แสดง
#define OLED_I2C_HZ             400000   // 400 kHz = ตามสเปก SH1106 (เดิมใช้ค่าปริยาย 100 kHz)
#define DROP_FALL_MS            240      // เวลาที่หยดหนึ่งหยดใช้ตกในแอนิเมชัน
#define MIN_OCCLUSION_MS        8000     // เวลาต่ำสุดที่ไม่มีหยดก่อนถือว่าหยุดไหล
#define NO_SIGNAL_MS            90000UL  // ติดต่อกันได้นานเท่านี้แต่ไม่เคยมีหยดเลย
                                         // = เซนเซอร์ยังจับหยดไม่ได้ (ไม่ใช่สายพับ)
                                         // 90 วินาที เผื่อเวลาพยาบาลจัดตำแหน่งเซนเซอร์เสร็จ
#define MAX_OCCLUSION_MS        300000   // เพดานเวลาตัดสินหยุดไหล (อัตราต่ำมาก)
#define RATE_DEVIATION_HOLD_MS  20000    // เร็ว/ช้าเกินต่อเนื่อง 20 วินาทีจึงเตือน
#define SNOOZE_MS               120000   // พักเสียง 2 นาที
#define NEAR_END_REMIND_MS      300000   // เตือนใกล้หมดซ้ำทุก 5 นาทีจนกว่าจะรับทราบ
#define DEFAULT_NEAR_END_PCT    80       // เตือนเมื่อให้ไปแล้ว 80% ของปริมาตรตามแผน
#define AP_MAX_CLIENTS          8        // จำนวนสมาร์ตโฟน/แท็บเล็ตที่ต่อพร้อมกันได้ (สูงสุด 10)
#define TIME_BACKUP_INTERVAL_MS 600000   // สำรองเวลาปัจจุบันลง NVS ทุก 10 นาที

