kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-OLED-V_4_7_3/ESP32-S3-Host-OLED-V_4_7_3.ino
      drawDripChamber(x + 44, topY + 15, totalH - 17, i);   // กระเปาะหยดประจำเตียง
    }
  }
  else {
    int cardW = 62;
    int rows = (activeStationCount + 1) / 2;
    int rowH = (rows <= 3) ? 14 : 10;   // 3-6 เตียง = 3 แถว, 7-8 เตียง = 4 แถว
    for (int i = 0; i < activeStationCount; i++) {
      int col = i % 2;
      int row = i / 2;
      int x = (col == 0) ? 0 : 65;
      int y = topY + row * rowH;
      int textY = y + ((rowH == 14) ? 9 : 7);

      bool online = isStationOnline(i);
      bool critical = online && stations[i].isRunning && isCriticalAlert(stations[i].alertCode);

      u8g2.drawRFrame(x, y, cardW, rowH - 1, 2);

      // เตียงที่มีเหตุวิกฤตทำป้ายเลขเตียงเป็นแถบทึบ เห็นชัดจากระยะไกลโดยไม่กลบทั้งการ์ด
      char idStr[8];
      snprintf(idStr, sizeof(idStr), "B%d", i + 1);
      u8g2.setFont(u8g2_font_4x6_tf);
      if (critical) {
        u8g2.drawBox(x + 1, y + 1, 10, rowH - 3);
        u8g2.setDrawColor(0);
        u8g2.drawStr(x + 2, textY, idStr);
        u8g2.setDrawColor(1);
      } else {
        u8g2.drawStr(x + 2, textY, idStr);
      }

      drawDripMini(x + 12, y + 1, rowH - 3, i);   // จังหวะหยดของเตียงนี้

      if (!online) {
        u8g2.drawStr(x + 19, textY, "OFFLINE");
      } else if (!stations[i].isRunning) {
        u8g2.drawStr(x + 19, textY, "PAUSED");
      } else {
        char rBuf[24];
        // ชิดขอบพอดี 43 px = 10 อักษร: "100mh 300"  (เดิมเลขติดป้ายเตียงจนอ่านไม่ออก)
        snprintf(rBuf, sizeof(rBuf), "%3.0fmh%4.0f", stations[i].flowRate_ml_hr, stations[i].totalVolumeMl);
        u8g2.drawStr(x + 19, textY, rBuf);
      }
    }
  }

  u8g2.drawHLine(0, 53, 128);
  u8g2.setFont(u8g2_font_5x8_tf);
  if (alarmBed > 0) {
    char alertBuf[32];
    snprintf(alertBuf, sizeof(alertBuf), "%sB%d %s", isSnoozed() ? "(ZZ) " : "! ", alarmBed, alertTextEn(alarmCode));
    u8g2.drawBox(0, 54, 128, 10);
    u8g2.setDrawColor(0);
    u8g2.drawStr(2, 62, alertBuf);
    u8g2.setDrawColor(1);
  } else {
    int nearBed = 0;
    for (int i = 0; i < activeStationCount; i++) {
      if (stations[i].alertCode == ALERT_NEAR_END && !stations[i].nearEndAck) { nearBed = i + 1; break; }
    }
    char statBuf[32];
    if (nearBed > 0) {
      const StationData &ns = stations[nearBed - 1];
      int pct = (ns.cfg.planVolumeMl > 0) ? (int)(ns.totalVolumeMl * 100.0f / ns.cfg.planVolumeMl) : 0;
      snprintf(statBuf, sizeof(statBuf), "B%d NEXT BAG %d%% [PWR]", nearBed, pct);
      u8g2.drawFrame(0, 54, 128, 10);
      u8g2.drawStr(2, 62, statBuf);
    } else {
      snprintf(statBuf, sizeof(statBuf), "CH%d WiFi:%d | Bed:%d/%d", currentWifiChannel(),
               (int)WiFi.softAPgetStationNum(), onlineCount, activeStationCount);
      u8g2.drawStr(0, 62, statBuf);
    }
  }
}

void updateHostOLED() {
  if (oledDisplaySleeping || isPowerOffProgressActive) return;
  u8g2.clearBuffer();

  bool nearPending = anyNearEndPending();
  if (!oledScreensaverActive && !globalAlarmTriggered && !nearPending && (millis() - lastUserActivityTime >= 300000)) {
    oledScreensaverActive = true;
  }
  // มีเหตุวิกฤต (ยังไม่พักเสียง) หรือเตือนใกล้หมดที่ยังไม่รับทราบ -> ออกจาก Screensaver เพื่อแสดงเตือน
  if (oledScreensaverActive && ((globalAlarmTriggered && !isSnoozed()) || nearPending)) {
    oledScreensaverActive = false;
    currentOledPage = 0;
  }

  if (oledScreensaverActive) {
    u8g2.setFont(u8g2_font_7x13_tf);
    u8g2.drawStr(20, 10, "SMART IV CLOCK");
    u8g2.drawHLine(10, 13, 108);

    u8g2.setFont(u8g2_font_logisoso32_tf);
    String clockStr = getOledClockStr();
    u8g2.drawStr(4, 56, clockStr.c_str());
  }
  else if (currentOledPage == 0) {
    u8g2.setFont(u8g2_font_5x8_tf);
    u8g2.drawStr(0, 7, "BLOCK MONITOR");
    char hBatBuf[16];
    snprintf(hBatBuf, sizeof(hBatBuf), "Beds:%d", activeStationCount);
    u8g2.drawStr(92, 7, hBatBuf);
    u8g2.drawHLine(0, 9, 128);

    renderBlockStyleGrid();
  }
  else if (currentOledPage >= 1 && currentOledPage <= activeStationCount) {
    int idx = currentOledPage - 1;
    const StationData &s = stations[idx];
    bool isOnline = isStationOnline(idx);
    bool isPaused = isOnline && !s.isRunning;

    u8g2.setFont(u8g2_font_5x8_tf);
    char headBuf[24];
    snprintf(headBuf, sizeof(headBuf), "BED %02d DETAIL  Df:%d", currentOledPage, safeDropFactor(s.cfg.dropFactor));
    u8g2.drawStr(0, 7, headBuf);
    u8g2.drawHLine(0, 9, 128);

    // กระเปาะหยดอยู่ชิดขวา ข้อความทั้งหมดจึงเหลือความกว้าง 108 px
    drawDripChamber(112, 12, 42, idx);

    char rateBuf[28];
    if (!isOnline) snprintf(rateBuf, sizeof(rateBuf), "Rate: OFFLINE");
    else if (isPaused) snprintf(rateBuf, sizeof(rateBuf), "Rate: 0.0 PAUSE");
    else snprintf(rateBuf, sizeof(rateBuf), "Rate:%3.1f mL/h", s.flowRate_ml_hr);
    u8g2.setFont(u8g2_font_6x10_tf);
    u8g2.drawStr(0, 21, rateBuf);

    u8g2.setFont(u8g2_font_5x8_tf);
    char volBuf[32];
    snprintf(volBuf, sizeof(volBuf), "V:%.0f/%.0f Set:%.0f", s.totalVolumeMl, s.cfg.planVolumeMl, s.cfg.targetRateHr);
    u8g2.drawStr(0, 32, volBuf);

    char statusBuf[32];
    if (!isOnline) snprintf(statusBuf, sizeof(statusBuf), "St: NO SIGNAL");
    else if (isPaused) snprintf(statusBuf, sizeof(statusBuf), "St: PAUSED/STOP");
    else if (s.alertCode == ALERT_NEAR_END) snprintf(statusBuf, sizeof(statusBuf), "St: NEXT BAG %s", s.nearEndAck ? "(ACK)" : "!");
    else if (s.alertCode != ALERT_NONE) snprintf(statusBuf, sizeof(statusBuf), "St: !%s!", alertTextEn(s.alertCode));
    else snprintf(statusBuf, sizeof(statusBuf), "St: NORMAL FLOW");
    u8g2.drawStr(0, 42, statusBuf);

    // คุณภาพลิงก์ = ได้รับกี่ % ของแพ็กเก็ตที่ควรได้ใน 10 วินาทีล่าสุด
    // ต่างจาก RSSI ตรงที่บอก "ข้อมูลหายจริงไหม" ไม่ใช่แค่ "สัญญาณแรงแค่ไหน"
    char linkBuf[32];
    if (s.batteryVolts > 0.5)
      snprintf(linkBuf, sizeof(linkBuf), "%ddBm L:%d%% %1.2fV", s.rssi, s.linkPct, s.batteryVolts);
    else
      snprintf(linkBuf, sizeof(linkBuf), "%ddBm Link:%d%%", s.rssi, s.linkPct);
    u8g2.drawStr(0, 52, linkBuf);

    u8g2.drawHLine(0, 55, 128);
    if (isOnline && s.linkPct > 0 && s.linkPct < LINK_WEAK_PCT) {
      u8g2.drawBox(0, 56, 128, 8);
      u8g2.setDrawColor(0);
      u8g2.drawStr(2, 63, "! WEAK LINK - CHECK RF");
      u8g2.setDrawColor(1);
    } else {
      u8g2.drawStr(0, 63, "[PAGE:Next | Dbl:Clock]");
    }
  }

  u8g2.sendBuffer();
}

// ----------------------------------------------------------------------------
// REST APIs & Handlers
// ----------------------------------------------------------------------------
void handleApiData() {
  if (!server.authenticate(web_username, web_password)) return server.requestAuthentication();
  String json;
  json.reserve(3000);
  json = "{";
  json += "\"version\":\"" APP_VERSION "\",";
  json += "\"activeCount\":" + String(activeStationCount) + ",";
  json += "\"currentTime\":\"" + getFormattedDateTime() + "\",";
  json += "\"timeSynced\":" + String(isTimeSynced ? "true" : "false") + ",";
  json += "\"timeApprox\":" + String(isTimeApprox ? "true" : "false") + ",";
  json += "\"apClients\":" + String(WiFi.softAPgetStationNum()) + ",";
  json += "\"apMaxClients\":" + String(AP_MAX_CLIENTS) + ",";
  json += "\"channel\":" + String(currentWifiChannel()) + ",";
  json += "\"hostBatVolts\":" + String(hostBatteryVolts, 2) + ",";
  json += "\"hostBatPct\":" + String(hostBatteryPct) + ",";
  json += "\"snoozed\":" + String(isSnoozed() ? "true" : "false") + ",";
  json += "\"linkWeakPct\":" + String(LINK_WEAK_PCT) + ",";
  json += "\"syncFail\":" + String(syncSendFail) + ",";
  json += "\"stations\":[";
  for (int i = 0; i < activeStationCount; i++) {
    const StationData &s = stations[i];
    bool isOnline = isStationOnline(i);
    if (i > 0) json += ",";
    json += "{";
    json += "\"id\":" + String(i + 1) + ",";
    json += "\"online\":" + String(isOnline ? "true" : "false") + ",";
    json += "\"running\":" + String(s.isRunning ? "true" : "false") + ",";
    json += "\"rssi\":" + String(isOnline ? s.rssi : 0) + ",";
    json += "\"link\":" + String(s.linkPct) + ",";
    json += "\"rxTotal\":" + String(s.rxTotal) + ",";
    json += "\"battery\":" + String(s.batteryVolts, 2) + ",";
    json += "\"totalDrops\":" + String(s.totalDrops) + ",";
    json += "\"volumeMl\":" + String(s.totalVolumeMl, 2) + ",";
    json += "\"flowRateHr\":" + String(s.flowRate_ml_hr, 2) + ",";
    json += "\"msSinceLastDrop\":" + String(s.msSinceLastDrop) + ",";
    json += "\"targetRate\":" + String(s.cfg.targetRateHr, 1) + ",";
    json += "\"planVolume\":" + String(s.cfg.planVolumeMl, 0) + ",";
    json += "\"dropFactor\":" + String(safeDropFactor(s.cfg.dropFactor)) + ",";
    json += "\"patientName\":\"" + jsonEscape(s.cfg.patientName) + "\",";
    json += "\"alertCode\":" + String(s.alertCode) + ",";
    json += "\"nearEndPct\":" + String(safeNearPct(s.nearEndPct)) + ",";
    json += "\"nearEndAck\":" + String(s.nearEndAck ? "true" : "false") + ",";
    json += "\"caseActive\":" + String(s.trialCase.active ? "true" : "false") + ",";
    json += "\"caseStart\":\"" + String(s.trialCase.startTimeStr) + "\"";
    json += "}";
  }
  json += "]}";
  server.send(200, "application/json", json);
}

int parseStationArg() {
  if (!server.hasArg("station")) return -1;
  int st = server.arg("station").toInt();
  if (st < 1 || st > MAX_SUPPORTED_STATIONS) return -1;
  return st - 1;
}

// POST /api/stations/config  station, rate, volume, df, name (ส่งเฉพาะที่ต้องการเปลี่ยน)
void handleStationConfig() {
  if (!server.authenticate(web_username, web_password)) return server.requestAuthentication();
  int idx = parseStationArg();
  if (idx < 0) { server.send(400, "text/plain", "Invalid station"); return; }

